Revit 2024 API
Transform1D Members
The Transform1D type exposes the following members.
Constructors
Name | Description
Transform1D(Double)
 Constructs the transformation by specifying the scale only.
Transform1D(Transform1D)
 The copy constructor.
Transform1D(Double, Double)
 Constructs the transformation by specifying the scale and the translation.
Methods
Name | Description
AlmostEqual
 Determines whether this transformation and the specified transformation are the same within the tolerance (1.0e-09).
Assign
 Assigns values from the input transformation to this transformation.
Dispose
Releases all resources used by the Transform1D
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetInverse
 Gets the inverse transformation of this transformation.
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
Multiply
 Multiplies this transformation by the specified transformation and returns the result.
OfPoint
 Applies the transformation to the 1-dimensional point and returns the result.
OfVector
 Applies the transformation to the 1-dimensional vector (a "tangent vector" on the real line) and returns the result.
SetToIdentity
 Set this TrfUV to the identity transform
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
TransformParameterDomain
 Performs a transform of the parameter range defined by domain, and ensures that the domain is ordered correctly.
Properties
Name | Description
Determinant
 The determinant of this transformation.
IsIdentity
 The boolean value that indicates whether this transformation is an identity.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
Scale
 The real number that represents the scale of this transformation.
Translation
 The translational part of this transformation.
See Also
Transform1D Class
Autodesk.Revit.DB Namespace